{"tag_name":"v21.11","name":"Rilis v21.11","zipball_url":"https:\/\/api.github.com\/repos\/OpenSID\/OpenSID\/zipball\/v21.11","tarball_url":"https:\/\/api.github.com\/repos\/OpenSID\/OpenSID\/tarball\/v21.11","body":"### v21.11-premium\r\n\r\nDi rilis ini, versi 21.11-premium, menyediakan Kaitkan indikator\/pertanyaan analisis dengan data saran penduduk dan keluarga, Tampilkan data Pembangunan di halaman WEB. Rilis ini juga berisi penambahan fitur dan perbaikan lain yang diminta Komunitas SID.\r\n\r\nTerima kasih pada @andifahruddinakas dan @agungsugiarto yang terus berkontribusi.\r\n\r\n#### Penambahan Fitur\r\n1. [#4366](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4366) RSS Feeds artikel sekarang berisi tanggal unggah artikel.\r\n2. [#4440](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4440) Perbaiki tampilan hasil analisis di web, supaya indikator ditampilkan per master analisis.\r\n3. [#4446](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4446) Perbaiki surat keterangan nikah sesuai dg KEPDIRJEN BIMAS ISLAM NO. 473 TAHUN 2020.\r\n4. [#4322](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4322) Sediakan notifikasi telegram ke pengguna admin \/ operator.\r\n5. [#4376](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4376) Pencarian dan kategori produk pada web lapak.\r\n6. [#3844](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/3844) Perjelas keterangan data kependudukan wilayah pada halaman website desa.\r\n7. [#3404](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/3404) Penyesuaian Istilah Baru tentng COVID-19.\r\n8. [#4402](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4402) Tampilkan data Pembangunan di halaman WEB.\r\n9. [#4404](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4404) Kaitkan indikator\/pertanyaan analisis dengan data saran penduduk dan keluarga.\r\n10. [#4352](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4352) Sediakan kolom input ID BDT di menu Tambah Rumah Tangga Baru.\r\n11. Ubah No. KK Sementara dari 0 menjadi 16 digit diawali 0, dengan format 0[kode-desa-10-digit][nomor-urut-5-digit]\r\n12. Sediakan bisa pecah seluruh anggota keluarga status mati\/hilang\/pindah dan masukkan ke keluarga baru.\r\n\r\n#### Perbaikan BUG\r\n1. [#4450](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4450) Perbaiki bisa unduh salinan kartu keluarga.\r\n2. [#4451](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4451) Daftar Pembangunan sekarang menampilkan semua pembangunan.\r\n3. Tambahkan penjelasan dan validasi pengisian waktu di form Pembangunan.\r\n4. [#4455](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4455) Data keluarga dengan KK yang mati\/pindah\/hilang sekarang tidak dapat diubah.\r\n5. [#4458](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4458) Perbaiki tombol simpan tidak berfungsi pada input menu Buku Tanah di Desa.\r\n6. [#4459](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4459) Perbaiki error 500 ketika melakukan pengosongan Basisdata.\r\n7. Sekarang pilihan 'Bawa bukti fisik ke Kantor Desa' untuk syarat dokumen di layanan surat anjungan kembali tersedia.\r\n8. [#4456](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4456) Perbaiki menampilkan penerima bantuan dari statistik program bantuan.\r\n9. [#4461](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4461) Izinkan data penduduk sama di modul buku tanah di desa.\r\n10. [#4467](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4467) Perbaiki tidak bisa simpan data produk dengan tipe potongan persen (%).\r\n11. [#4462](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4462) Perbaiki urut permohonan surat.\r\n12. [#4471](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4471) Perbaiki buka halaman verifikasi surat.\r\n13. Perbaiki validasi input warna di Identitas Desa Peta Wilayah\r\n14. [#4484](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4484) Perbaiki impor data penduduk yg data keluarga tdk tampil.\r\n15. [#4485](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4485) Batasi input data Nomor Rumah Tangga maksimal 30 karakter.\r\n16. [#4492](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4492) Perbaiki gagal akses modul Inventaris dan Kekayaan Desa jika data masih kosong\/tidak ada.\r\n17. [#4483](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4483) Perbaiki gagal menampilkan file\/gambar dengan nama yang berkarakter kshsus (misalnya persen (%)).\r\n18. [#4494](https:\/\/github.com\/OpenSID\/OpenSID\/issues\/4494) Perbaiki ubah menu untuk kelompok yang salah.\r\n\r\n#### Perubahan Teknis\r\n1. Pindahkan tampilan lapak ke masing-masing tema.\r\n2. Pindahkan Info System ke controller tersendiri.\r\n3. Pindahkan folder cache ke desa > cache.\r\n4. Gunakan devtool debugbar untuk development.\r\n5. Sederhanakan paging pada tema klasik.\r\n\r\n### v21.11-umum\r\n\r\nDi rilis ini, versi 21.11 melengkapi Buku Administrasi Desa > Buku Administrasi Penduduk dan menyediakan fitur merekam foto penduduk langsung dari kamera HP\/DSLR. Rilis ini juga berisi perbaikan lain yang diminta Komunitas SID.\r\n\r\nTerima kasih pada @fusionid dan @andifahruddinakas yang terus berkontribusi. Terima kasih pula pada @apidong  yang baru mulai berkontribusi.\r\n\r\nLengkapnya, isi rilis versi 21.11 adalah sebagai berikut:\r\n\r\n\r\nFitur v21.04-premium yang digabungkan adalah sebagai berikut:\r\n\r\nPremium - perbaikan bug:\r\n\r\n1. #4040: Petugas yang pertama kali memasukkan data penduduk kembali ditampilkan. [bug-fix]\r\n2. #4041: Penambahan KK dan anggota keluarga baru sekarang normal kembali. [bug-fix]\r\n3. Tidak tampilkan kolom isian Tanggal Lapor di form ubah biodata penduduk. [bug-fix]\r\n4. Statistik > Laporan Bulanan di baris Kelahiran\/Keluarga Baru sekarang dibatasi melaporkan keluarga baru yg dibentuk dari penduduk yang ada (mis. setelah pecah keluarga). [bug-fix]\r\n5. Tutup celah SQL injection di tampilan analisis di Web. [security-fix]\r\n6. #4078: Sekarang pilihan layanan mandiri di form pengaturan surat baru tersimpan benar. [bug-fix]\r\n7. #4069: Perbaiki tampilkan data wilayah di laporan cetak Data Kependudukan Wilayah. [bug-fix]\r\n8. Tutup celah pengguna layanan mandiri bisa lihat dokumen penduduk lain. [security-fix]\r\n9. #4062: Sekarang jumlah peserta di statistik program bantuan tampil benar untuk kasus di mana ada penduduk yang kolom lokasi tempat tinggal kosong. [bug-fix]\r\n10. #4087: Sekarang di laporan cetak statistik kependudukan, penandatangan tampil benar untuk kasus di mana perangkat desa yg dipilih sebelumnya diubah di Pemerintahan Desa dari Tidak Terdata menjadi Dari Database Penduduk. [bug-fix]\r\n11. #4020: Sekarang di form Pembangunan lokasi menampilkan semua wilayah, termasuk dusun yg tidak ada RW atau RT. [bug-fix]\r\n12. #4081: Sekarang penandatangan laporan cetak inventaris sesuai dengan yang dipilih. [bug-fix]\r\n13. #4092: Sekarang di form Persil lokasi menampilkan semua wilayah, termasuk dusun yg tidak ada RW atau RT. [bug-fix]\r\n14. #4088: Perbaiki alur permohonan surat layanan mandiri supaya membatasi akses menu sesuai status permohonan. [security-fix]\r\n15. #4096: Perbaiki dan perjelas alur pengelolaan permohonan surat layanan mandiri di modul Admin supaya membatasi akses menu sesuai status permohonan. [bug-fix]\r\n16. #4084: Perbaiki urutan Rumah Tangga. [bug-fix]\r\n17. #3356: Sekarang tidak bisa lagi memasukkan peserta duplikat ke program bantuan. [bug-fix]\r\n18. #3629: Tampilkan semua persil di pilihan persil di form tambah persil C-Desa, termasuk persil yang lokasinya diisi manual atau wilayahnya telah dihapus. [bug-fix]\r\n19. #4102: Sekarang nomor telepon tampil di halaman Offline Mode (web sementara tidak dapat diakses). [bug-fix]\r\n20. #4104: Pengaturan offline mode sekarang normal kembali. [bug-fix]\r\n\r\n\r\nPremium - penambahan fitur:\r\n\r\n1. #3962: Sekarang bisa sisipkan QRCode di layanan surat berisi tautan untuk verifikasi keabsahan surat.\r\n2. #4036: Tampilkan notifikasi masa berlangganan layanan OpenDesa di header Admin.\r\n3. #790: Sediakan fitur impor\/ekspor Data Suplemen.\r\n4. #4058: Sediakan fitur untuk membaca QR Code dari file atau dari kamera perangkat.\r\n5. #4057: Gunakan scan e-KTP untuk login layanan mandiri, cari penduduk dan pilih penduduk di form surat.\r\n6. #4029: Tampilkan batas ukuran unggahan dokumen kelengkapan penduduk di Layanan Mandiri dan menu Penduduk.\r\n7. Pilih pamong penandatangan secara otomatis di form cetak Wilayah Administratif, Pembangunan dan Data Suplemen.\r\n8. #3524: Sekarang kepala desa di Identitas Desa diambil dari pamong di Pemerintahan Desa.\r\n9. #4077: Kode indikator & pertanyaan analisis sekarang bisa berisi huruf.\r\n10. #3999: Di Web desa, tampilkan data peserta program bantuan sesuai kartu peserta.","created_at":"2021-11-01T02:43:35Z","published_at":"2021-11-01T02:44:17Z"}